app/controllers/articles_controller.rb

  def find_owner
    @owner = Owner.friendly.find(params[:owner_id])
---
SELECT  "owners".* FROM "owners"  WHERE "owners"."id" = ? LIMIT 1  [["id", 1]]

  def find_article
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]