app/controllers/landing_pages_controller.rb

  def index
    @owner = Owner.order("RANDOM()").limit(1).first
    @article = Article.order("RANDOM()").limit(1).first
---
SELECT  "owners".* FROM "owners"   ORDER BY "owners"."id" ASC LIMIT 1
SELECT  "articles".* FROM "articles"   ORDER BY "articles"."id" ASC LIMIT 1