app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
  def index
    @owners = Owner.all

SELECT  "owners".* FROM "owners"  WHERE "owners"."id" = ? LIMIT 1  [["id", 0]]
---
  def find_owner
    @owner = Owner.friendly.find(params[:id])